<?php

namespace Database\Seeders;

use App\Models\Story;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class StorySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        Story::create([
            'title'=>'الأقصوصة الأولي ',
            'description'=>'أقصوصة من العصر القديم ',
            'content'=>' تأخذنا إلى عمق العصور القديمة، حيث يتقاطع الحلم مع الواقع. في هذا الزمان، نشهد قصة غامضة تتناول تحديات ومحن أبطال لا يعرفون المستحيل.تأخذنا إلى عمق العصور القديمة، حيث يتقاطع الحلم مع الواقع. في هذا الزمان، نشهد قصة غامضة تتناول تحديات ومحن أبطال لا يعرفون المستحيل. ',
        ]);
        Story::create([
            'title'=>'الأقصوصة الثانية ',
            'description'=>'أقصوصة من العصر الروماني ',
            'content'=>' تنقلنا إلى عهد الرومان، حيث تتعايش الشجاعة مع الخيانة والحب يتحدى الزمن. قصة تنسج خيوطها في قلب الإمبراطورية الرومانية، محملة بالأحداث الملحمية.تنقلنا إلى عهد الرومان، حيث تتعايش الشجاعة مع الخيانة والحب يتحدى الزمن. قصة تنسج خيوطها في قلب الإمبراطورية الرومانية، محملة بالأحداث الملحمية. ',
        ]);
        Story::create([
            'title'=>'الأقصوصة الثالثة ',
            'description'=>'أقصوصة من العصر الفرعوني ',
            'content'=>'تأخذنا إلى أوج عظمة الفراعنة، حيث يسكن السحر والسرور في قلب الصحراء. قصة تحكي عن أسرار الأهرامات وما وراء الأفق، معلنة عن بداية رحلة فريدة في تاريخ البشرية.تأخذنا إلى أوج عظمة الفراعنة، حيث يسكن السحر والسرور في قلب الصحراء. قصة تحكي عن أسرار الأهرامات وما وراء الأفق، معلنة عن بداية رحلة فريدة في تاريخ البشرية. ',
        ]);
        Story::create([
            'title'=>'الأقصوصة الرابعة ',
            'description'=>'أقصوصة من العصر الحديث ',
            'content'=>' تنقلنا إلى العصر الحديث، حيث يتقاطع القديم مع المستقبل. قصة تروي تحولات العالم الحديث، وكيف يتغير وجه التاريخ بين لحظة وأخرى.تنقلنا إلى العصر الحديث، حيث يتقاطع القديم مع المستقبل. قصة تروي تحولات العالم الحديث، وكيف يتغير وجه التاريخ بين لحظة وأخرى. ',
        ]);






        Story::create([
            'title'=>'الأقصوصة الأولي ',
            'description'=>'أقصوصة من العصر القديم ',
            'content'=>' تأخذنا إلى عمق العصور القديمة، حيث يتقاطع الحلم مع الواقع. في هذا الزمان، نشهد قصة غامضة تتناول تحديات ومحن أبطال لا يعرفون المستحيل.تأخذنا إلى عمق العصور القديمة، حيث يتقاطع الحلم مع الواقع. في هذا الزمان، نشهد قصة غامضة تتناول تحديات ومحن أبطال لا يعرفون المستحيل. ',
        ]);
        Story::create([
            'title'=>'الأقصوصة الثانية ',
            'description'=>'أقصوصة من العصر الروماني ',
            'content'=>' تنقلنا إلى عهد الرومان، حيث تتعايش الشجاعة مع الخيانة والحب يتحدى الزمن. قصة تنسج خيوطها في قلب الإمبراطورية الرومانية، محملة بالأحداث الملحمية.تنقلنا إلى عهد الرومان، حيث تتعايش الشجاعة مع الخيانة والحب يتحدى الزمن. قصة تنسج خيوطها في قلب الإمبراطورية الرومانية، محملة بالأحداث الملحمية. ',
        ]);
        Story::create([
            'title'=>'الأقصوصة الثالثة ',
            'description'=>'أقصوصة من العصر الفرعوني ',
            'content'=>'تأخذنا إلى أوج عظمة الفراعنة، حيث يسكن السحر والسرور في قلب الصحراء. قصة تحكي عن أسرار الأهرامات وما وراء الأفق، معلنة عن بداية رحلة فريدة في تاريخ البشرية.تأخذنا إلى أوج عظمة الفراعنة، حيث يسكن السحر والسرور في قلب الصحراء. قصة تحكي عن أسرار الأهرامات وما وراء الأفق، معلنة عن بداية رحلة فريدة في تاريخ البشرية. ',
        ]);
        Story::create([
            'title'=>'الأقصوصة الرابعة ',
            'description'=>'أقصوصة من العصر الحديث ',
            'content'=>' تنقلنا إلى العصر الحديث، حيث يتقاطع القديم مع المستقبل. قصة تروي تحولات العالم الحديث، وكيف يتغير وجه التاريخ بين لحظة وأخرى.تنقلنا إلى العصر الحديث، حيث يتقاطع القديم مع المستقبل. قصة تروي تحولات العالم الحديث، وكيف يتغير وجه التاريخ بين لحظة وأخرى. ',
        ]);







        Story::create([
            'title'=>'الأقصوصة الأولي ',
            'description'=>'أقصوصة من العصر القديم ',
            'content'=>' تأخذنا إلى عمق العصور القديمة، حيث يتقاطع الحلم مع الواقع. في هذا الزمان، نشهد قصة غامضة تتناول تحديات ومحن أبطال لا يعرفون المستحيل.تأخذنا إلى عمق العصور القديمة، حيث يتقاطع الحلم مع الواقع. في هذا الزمان، نشهد قصة غامضة تتناول تحديات ومحن أبطال لا يعرفون المستحيل. ',
        ]);
        Story::create([
            'title'=>'الأقصوصة الثانية ',
            'description'=>'أقصوصة من العصر الروماني ',
            'content'=>' تنقلنا إلى عهد الرومان، حيث تتعايش الشجاعة مع الخيانة والحب يتحدى الزمن. قصة تنسج خيوطها في قلب الإمبراطورية الرومانية، محملة بالأحداث الملحمية.تنقلنا إلى عهد الرومان، حيث تتعايش الشجاعة مع الخيانة والحب يتحدى الزمن. قصة تنسج خيوطها في قلب الإمبراطورية الرومانية، محملة بالأحداث الملحمية. ',
        ]);
        Story::create([
            'title'=>'الأقصوصة الثالثة ',
            'description'=>'أقصوصة من العصر الفرعوني ',
            'content'=>'تأخذنا إلى أوج عظمة الفراعنة، حيث يسكن السحر والسرور في قلب الصحراء. قصة تحكي عن أسرار الأهرامات وما وراء الأفق، معلنة عن بداية رحلة فريدة في تاريخ البشرية.تأخذنا إلى أوج عظمة الفراعنة، حيث يسكن السحر والسرور في قلب الصحراء. قصة تحكي عن أسرار الأهرامات وما وراء الأفق، معلنة عن بداية رحلة فريدة في تاريخ البشرية. ',
        ]);
        Story::create([
            'title'=>'الأقصوصة الرابعة ',
            'description'=>'أقصوصة من العصر الحديث ',
            'content'=>' تنقلنا إلى العصر الحديث، حيث يتقاطع القديم مع المستقبل. قصة تروي تحولات العالم الحديث، وكيف يتغير وجه التاريخ بين لحظة وأخرى.تنقلنا إلى العصر الحديث، حيث يتقاطع القديم مع المستقبل. قصة تروي تحولات العالم الحديث، وكيف يتغير وجه التاريخ بين لحظة وأخرى. ',
        ]);





        Story::create([
            'title'=>'الأقصوصة الأولي ',
            'description'=>'أقصوصة من العصر القديم ',
            'content'=>' تأخذنا إلى عمق العصور القديمة، حيث يتقاطع الحلم مع الواقع. في هذا الزمان، نشهد قصة غامضة تتناول تحديات ومحن أبطال لا يعرفون المستحيل.تأخذنا إلى عمق العصور القديمة، حيث يتقاطع الحلم مع الواقع. في هذا الزمان، نشهد قصة غامضة تتناول تحديات ومحن أبطال لا يعرفون المستحيل. ',
        ]);
        Story::create([
            'title'=>'الأقصوصة الثانية ',
            'description'=>'أقصوصة من العصر الروماني ',
            'content'=>' تنقلنا إلى عهد الرومان، حيث تتعايش الشجاعة مع الخيانة والحب يتحدى الزمن. قصة تنسج خيوطها في قلب الإمبراطورية الرومانية، محملة بالأحداث الملحمية.تنقلنا إلى عهد الرومان، حيث تتعايش الشجاعة مع الخيانة والحب يتحدى الزمن. قصة تنسج خيوطها في قلب الإمبراطورية الرومانية، محملة بالأحداث الملحمية. ',
        ]);
        Story::create([
            'title'=>'الأقصوصة الثالثة ',
            'description'=>'أقصوصة من العصر الفرعوني ',
            'content'=>'تأخذنا إلى أوج عظمة الفراعنة، حيث يسكن السحر والسرور في قلب الصحراء. قصة تحكي عن أسرار الأهرامات وما وراء الأفق، معلنة عن بداية رحلة فريدة في تاريخ البشرية.تأخذنا إلى أوج عظمة الفراعنة، حيث يسكن السحر والسرور في قلب الصحراء. قصة تحكي عن أسرار الأهرامات وما وراء الأفق، معلنة عن بداية رحلة فريدة في تاريخ البشرية. ',
        ]);
        Story::create([
            'title'=>'الأقصوصة الرابعة ',
            'description'=>'أقصوصة من العصر الحديث ',
            'content'=>' تنقلنا إلى العصر الحديث، حيث يتقاطع القديم مع المستقبل. قصة تروي تحولات العالم الحديث، وكيف يتغير وجه التاريخ بين لحظة وأخرى.تنقلنا إلى العصر الحديث، حيث يتقاطع القديم مع المستقبل. قصة تروي تحولات العالم الحديث، وكيف يتغير وجه التاريخ بين لحظة وأخرى. ',
        ]);

        
    }
}